{
    "summary": "Motivated Full Stack Developer with 7 years of coding experience and over 2 years of combined industry experience in Full Stack Development, Solution Design and Data Analysis. Possesses strong problem-solving and technical skills, excelling in both independent and collaborative environments, with a commitment to continuous learning and growth. Seeking a role in an environment where my skills can be further developed while providing mutual benefit to the employer.",
    "work-experience": [
        {
            "job-title": "Solution Designer",
            "time-period": "May 2023 - Jan 2024",
            "company": "Huawei Technologies",
            "summary": "Design Solutions that solve problems for customers.",
            "detail": [
                "Developed Python-based tools to replace Excel for data analysis. Used Pandas, Numpy, and Seaborn to streamline complex data processing, generated statistics and visualisations to present insights into the current network situation and identified possible site locations. ",
                "As a Solution Engineer, responsible for the solution design, requirement analysis and project coordination for the Dynamic Spectrum Sharing (DSS) feature to improve the network experience for customers in Thailand and Indonesia. I have aligned technical details and assessed solution feasibility with other Solution Engineers and leaderships, discussed and refined the design with the development team. The features all successfully went online."
            ]
        },
        {
            "job-title": "Software Engineer",
            "time-period": "Dec 2021 - May 2023",
            "company": "Huawei Technologies",
            "summary": "Backend Web Developer worked in a team of 20, proficient in Java, Spring Boot, Maven and PostgreSQL, delivering web applications for industrial use.",
            "detail": [
                "Worked in a team of 20, developed and maintained a web application to support network design and planning for Huawei, utilised microservices architecture with RESTful APIs to facilitate communication between services.",
                "As a Backend Developer, proficiently used Java, Spring Boot, Maven, and PostgreSQL, with experience in Redis. Took on front-end development tasks, proficient in JavaScript, CSS and Vue.js.",
                "Demonstrated strong proficiency in the Agile development lifecycle by effectively participating in scrum meetings, managing tasks, prioritising work, and ensuring timely delivery.",
                "Strong team player, worked closely with Business Analysts, Test Engineers and Frontend Developers to align requirement and implementation details, ensuring efficient and timely project delivery. ",
                "Participated in architecture design, including requirement analysis, system design, and performance optimisation.",
                "As a code committer in Huawei's internal Git platform, ensured all merged code adhered to best practices, and met security standards while giving helpful and constructive comments when edits were needed."
            ]
        },
        {
            "job-title": "Teaching Assistant",
            "time-period": "Sep 2019 - Dec 2019",
            "company": "Queen Mary University of London",
            "summary": "Support the learning of students during lectures and lab sessions.",
            "detail": [
                "Provided timely support to students during weekly laboratory sessions and lectures for 2 Computer Science modules: Algorithms and Data Structures, and Logics and Discrete Structures.",
                "Communicated effectively with professors and students to identify learning needs, enhanced the learning experience for beginners by developing supplementary materials."
            ]
        }
    ],
    "education-experience": [
        {
            "degree": "MSc Artificial Intelligence",
            "university": "University of St Andrews",
            "time-period": "Sep 2020 - Sep 2021",
            "grade": "Distinction (Name on Dean's List)",
            "modules": "Artificial Intelligence, Machine Learning, Information Visualisation, OOP, Computer Security"
        },
        {
            "degree": "BSc Computer Science",
            "university": "Queen Mary University of London",
            "time-period": "Sep 2017 - Jul 2020",
            "grade": "First Class Honours",
            "modules": "Software Engineering, Web Development, Database Systems, Graphical User Interface, Interaction Design"
        }
    ],
    "projects": [
        {
            "name": "iDesigner Network Planning Web Application",
            "company": "Huawei Technologies",
            "time-period": "May 2022 - May 2023",
            "github": "",
            "live-demo": "",
            "technologies": "Java, Spring Boot, Maven, PostgreSQL, Redis, JavaScript, Vue.js",
            "summary": "A web application that generates network diagrams for devices, calculates configurations and exports detailed information into Excel, supporting Huawei's core business in network planning.",
            "img-url": "1.png",
            "detail": [
                "Led the development of three key microservices, handling form data processing, IP algorithms, and Excel imports/exports, ensuring functionality aligned with business needs.",
                "Enhanced performance by integrating multithreading and Redis caching, reducing query response times by 30% and improving user experience.",
                "Refactored code to adhere to SOLID principles, significantly improving maintainability and reducing development time by 50%."
            ]
        },
        {
            "name": "Network Data Analysation",
            "company": "Huawei Technologies",
            "time-period": "Sep 2023",
            "github": "",
            "live-demo": "",
            "technologies": "Python, Pandas, Numpy, Seaborn, Matplotlib, scikit-learn",
            "summary": "Developed Python tools to automate network data analysis, optimised site selection and improved strategic planning",
            "img-url": "2.png",
            "detail": [
                "Created automated tools that processed network coverage and traffic data, identifying over 10 potential high-traffic site locations in rural China.",
                "Streamlined analysis workflows, reducing data processing time by 70% through custom Python scripts.",
                "Presented data-driven insights to leadership, leading to strategic decisions that improved sales performance."
            ]
        },
        {
            "name": "Portfolio Website",
            "company": "Personal Project",
            "time-period": "Sep 2024",
            "github": "https://github.com/zifanwei/my-react-portfolio",
            "live-demo": "https://zifanwei.github.io/my-react-portfolio",
            "technologies": "React.js, HTML, CSS, JavaScript, GitHub Pages",
            "summary": "Personal portfolio website using React.js.",
            "img-url": "3.png",
            "detail": [
                "Designed and developed a responsive single-page application using React.js.",
                "Implemented a clean, modern design with smooth animations for an engaging user experience.",
                "Optimized performance and loading times by simplifying CSS and using lazy loading.",
                "Deployed the website on GitHub Pages for public accessibility."
            ]
        },
        {
            "name": "Task Management System",
            "company": "Personal Project",
            "time-period": "Aug 2024 - present",
            "github": "",
            "live-demo": "",
            "technologies": "Spring Boot, React.js, PostgreSQL, Java, JavaScript, CSS",
            "summary": "A task management app for organsing personal and group tasks.",
            "img-url": "4.png",
            "detail": [
                "Implemented task creation, deletion, and updating features.",
                "Integrated PostgreSQL for real-time data syncing.",
                "Used Material UI for clean and user-friendly design."
            ]
        }
    ],
    "certificates": [
        {
            "name": "Foundations of User Experience (UX) Design",
            "institution": "Google",
            "issued-date": "Mar 2024",
            "url": "https://www.coursera.org/account/accomplishments/records/UGDD8WAG7LZT"
        },
        {
            "name": "Start the UX Design Process: Empathise, Define, and Ideate",
            "institution": "Google",
            "issued-date": "Mar 2024",
            "url": "https://www.coursera.org/account/accomplishments/records/ZALE74FSARZL"
        }
    ],
    "skills": {
        "Programming Languages": [
            {
                "name": "Java",
                "level": 10
            },
            {
                "name": "Python",
                "level": 10
            },
            {
                "name": "JavaScript",
                "level": 8
            },
            {
                "name": "CSS",
                "level": 8
            },
            {
                "name": "HTML",
                "level": 8
            },
            {
                "name": "SQL",
                "level": 8
            }
        ],
        "Back-end Development": [
            {
                "name": "Spring Boot",
                "level": 10
            },
            {
                "name": "Maven",
                "level": 7
            },
            {
                "name": "Redis",
                "level": 3
            },
            {
                "name": "Django",
                "level": 8
            }
        ],
        "Data Analysis": [
            {
                "name": "Pandas",
                "level": 10
            },
            {
                "name": "Numpy",
                "level": 8
            },
            {
                "name": "Matplotlib",
                "level": 7
            },
            {
                "name": "Seaborn",
                "level": 7
            },
            {
                "name": "Tableau",
                "level": 5
            },
            {
                "name": "d3.js",
                "level": 5
            }
        ],
        "Machine Learning": [
            {
                "name": "scikit-learn",
                "level": 9
            },
            {
                "name": "Tensorflow",
                "level": 5
            },
            {
                "name": "pytorch",
                "level": 5
            }
        ],
        "Front-end & UI": [
            {
                "name": "React.js",
                "level": 8
            },
            {
                "name": "Vue.js",
                "level": 3
            },
            {
                "name": "Figma",
                "level": 8
            }
        ],
        "Operating Systems": [
            {
                "name": "MacOS",
                "level": 10
            },
            {
                "name": "Windows",
                "level": 7
            },
            {
                "name": "Linux",
                "level": 5
            }
        ]
    },
    "skillSummary": [
        {
            "title": "Full-Stack Web Development",
            "description": "Proficiently develop both Front-end and Back-end functionalities for web applications.",
            "icon": "/icon/web_dev.png"
        },
        {
            "title": "UI/UX Design",
            "description": "Empathise with users, design interfaces and workflows that ensure best user experience.",
            "icon": "/icon/ui_ux_design.png"
        },
        {
            "title": "Creative Solutions",
            "description": "Continuously learning of trending technologies and designs and apply them appropriately in projects.",
            "icon": "/icon/creativity.png"
        },
        {
            "title": "Independent Problem Solving",
            "description": "Strong problem-solving skills with a knack for finding optimised solutions in various situations.",
            "icon": "/icon/problem_solving.png"
        },
        {
            "title": "Supportive Team Member",
            "description": "Active and supportive in collaborative environments, always willing to contribute ideas and effort.",
            "icon": "/icon/teamworking.png"
        },
        {
            "title": "Effective Communicator",
            "description": "Good at grasping key points in conversations and conveying messages clearly and concisely.",
            "icon": "/icon/communication.png"
        }
    ],
    "languageSkills": [
        {
            "language": "🇨🇳 Chinese (Mandarin)",
            "level": "Native Speaker",
            "description": "Proficient in reading, writing, listening, and speaking under academic and business situations."
        },
        {
            "language": "🇬🇧 English",
            "level": "Fluent",
            "description": "Proficient in reading, writing, listening, and speaking under both academic and business situations."
        },
        {
            "language": "🇳🇱 Dutch",
            "level": "Beginner",
            "description": "Familiar with a few basic phrases and words, actively progressing in learning."
        }
    ]
}